# Visualization and Plotting in Pandas

Pandas integrates seamlessly with popular visualization libraries like Matplotlib and Seaborn, allowing you to create insightful visualizations directly from your data. You can plot Series data using built-in plotting functions, customize plot aesthetics, and generate complex plots from DataFrame structures, enabling effective communication of insights derived from your analysis.

# Example Usage:

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

# Sample data
data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Sales': [100, 120, 150, 130, 140],
    'Expenses': [80, 90, 100, 110, 95]
}

# Creating a DataFrame
df = pd.DataFrame(data)

# Displaying the DataFrame
print("DataFrame:")
print(df)
print()

In [ ]:
# Plotting Sales and Expenses data
plt.figure(figsize=(10, 6))  # Set figure size
plt.plot(df['Month'], df['Sales'], marker='o', color='blue', linestyle='-', linewidth=2, markersize=8, label='Sales')
plt.plot(df['Month'], df['Expenses'], marker='s', color='red', linestyle='--', linewidth=2, markersize=8, label='Expenses')
plt.title('Monthly Sales and Expenses')
plt.xlabel('Month')
plt.ylabel('Amount')
plt.legend()  # Show legend
plt.grid(True)
plt.show()

In [ ]:
# Plotting Sales and Expenses data (bar plot)
plt.figure(figsize=(10, 6))  # Set figure size
bar_width = 0.35
index = range(len(df['Month']))
plt.bar(index, df['Sales'], bar_width, color='blue', label='Sales')
plt.bar([i + bar_width for i in index], df['Expenses'], bar_width, color='red', label='Expenses')
plt.title('Monthly Sales and Expenses (Bar Plot)')
plt.xlabel('Month')
plt.ylabel('Amount')
plt.xticks([i + bar_width / 2 for i in index], df['Month'])  # Set x-axis ticks
plt.legend()  # Show legend
plt.grid(axis='y')  # Show grid lines on y-axis
plt.show()

In [ ]:
# Plotting Sales and Expenses data (stacked bar plot)
plt.figure(figsize=(10, 6))  # Set figure size
plt.bar(df['Month'], df['Sales'], color='blue', label='Sales')
plt.bar(df['Month'], df['Expenses'], bottom=df['Sales'], color='red', label='Expenses')
plt.title('Monthly Sales and Expenses (Stacked Bar Plot)')
plt.xlabel('Month')
plt.ylabel('Amount')
plt.legend()  # Show legend
plt.grid(axis='y')  # Show grid lines on y-axis
plt.show()

# Assigment

In this lab exercise, you will explore a dataset containing information about employees in a company using Pandas. You will perform various data manipulation and analysis tasks to gain insights into the employee data.

**Dataset:**
You are provided with a dictionary containing employee information:

In [ ]:
# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

## Tasks:

**DataFrame Creation:**
- Create a Pandas DataFrame named 'employees' from the provided dictionary 'data'.

**Indexing and Slicing:**
- Access the last 2 rows and the 'Name' and 'Salary' columns using both label-based and positional-based indexing.
- Extract the data for employees with indices 0 to 2 and all columns using integer-based indexing.
**Boolean Indexing:**
- Filter the data to include only employees aged 30 or above.

In [9]:
employees = pd.DataFrame(data)
employees

      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Tokyo   70000
4     Emma   32    Sydney   65000

In [ ]:
employees.loc[3:4, ["Name", "Salary"]]

In [13]:
employees.iloc[3:5, [0,3]]

    Name  Salary
3  David   70000
4   Emma   65000

In [14]:
employees[employees["Age"]>= 30]

      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
4     Emma   32    Sydney   65000